УТ_для_edt/src/DataProcessors/смартПроверкаНеобходимостиПроведенияТОУКлиентов/смартПроверкаНеобходимостиПроведенияТОУКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартПроверкаНеобходимостиПроведенияТОУКлиентов</name>
  <comment>#Б-2176 смарт: Лопато 06.02.2025 //ТО оборудования. Исключения по формированию документов &quot;Регламентное обслуживание клиентов&quot;</comment>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/смартТехническоеОбслуживаниеОборудованияПоКлиентам/смартТехническоеОбслуживаниеОборудованияПоКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартТехническоеОбслуживаниеОборудованияПоКлиентам</name>
  <comment>// смарт:ММ #099 409 23.03.2021</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Представительство</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданДокументРегламентноеОбслуживание</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаТОУКлиента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПодписанияАктаНаПНР</name>
    <comment>// 03.12.2020</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокЗамены</name>
    <type>
      <types>EnumRef.смартСрокиЗаменыЗапчастей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Запчасть</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартТехническоеОбслуживаниеОборудования/смартТехническоеОбслуживаниеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартТехническоеОбслуживаниеОборудования</name>
  <comment>// смарт:rnp 409 15.12.2020</comment>
  <resources>
    <name>СрокЗамены</name>
    <type>
      <types>EnumRef.смартСрокиЗаменыЗапчастей</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Запчасть</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартРуководителиМенеджеровСЦ/смартРуководителиМенеджеровСЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартРуководителиМенеджеровСЦ</name>
  <comment>// 05.06.2021</comment>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыРегламентногоОбслуживания/смартСтатусыРегламентногоОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыРегламентногоОбслуживания</name>
  <comment>// 05.06.2021</comment>
  <enumValues>
    <name>НеобходимоСвязатьсяСКлиентом</name>
  </enumValues>
  <enumValues>
    <name>СКлиентомСозвонились</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеПоТООтправлено</name>
  </enumValues>
  <enumValues>
    <name>ПовторныйЗвонокКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВыставленСчетНаКомплект</name>
  </enumValues>
  <enumValues>
    <name>СчетОплачен</name>
  </enumValues>
  <enumValues>
    <name>ТОВыполнено</name>
  </enumValues>
  <enumValues>
    <name>КлиентОтказалсяОтПрохожденияТО</name>
  </enumValues>
  <enumValues>
    <name>ОформленаЗаявкаНаВыездИнженера</name>
    <comment>//смарт:ММ 30.08.2021</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВидыСобытийВзаимодействий/смартВидыСобытийВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыСобытийВзаимодействий</name>
  <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  <enumValues>
    <name>ВходящийТелефонныйЗвонок</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  </enumValues>
  <enumValues>
    <name>СозданиеДокументаИнтерес</name>
    <comment>#1760 смарт: Ермаков 12.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.</comment>
  </enumValues>
  <enumValues>
    <name>НайденСуществующийПартнер</name>
    <comment>#1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартРегламентноеОбслуживаниеКлиентов/смартРегламентноеОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартРегламентноеОбслуживаниеКлиентов</name>
  <comment>// смарт:ММ #099 409 25.03.2021</comment>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТОУКлиента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЗамены</name>
    <type>
      <types>EnumRef.смартСрокиЗаменыЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписанияАктаНаПНР</name>
    <comment>// 03.12.2020</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>//смарт:ММ 30.05.2021</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>DocumentRef.смартЗаявкаНаПускоНаладку</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>EnumRef.смартСтатусыРегламентногоОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначенныйМенеджерСЦ</name>
    <comment>//смарт:ММ 30.08.2021</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Запчасть</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСрокГарантии</name>
    <comment>//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартПроверкаНеобходимостиПроведенияТОУКлиентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ВыполнитьПроверкуНеобходимостиПроведенияТОУКлиентов(ДатаПроверки = Неопределено) Экспорт

	ИмяСобытияДляЖР = "ПроверкаНеобходимостиПроведенияТОУКлиентов_смарт";

	ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР, УровеньЖурналаРегистрации.Информация,,, "Начало");

	//Определение интервала проверки
	Если НЕ ЗначениеЗаполнено(ДатаПроверки) Тогда
		ДатаПроверки = ТекущаяДатаСеанса();
	КонецЕсли;

	КоличествоДней = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("РабочихДнейДляУведомленияОТО", Ложь);

	Если НЕ ЗначениеЗаполнено(КоличествоДней) Тогда
		КоличествоДней = 15;
	КонецЕсли;
	
	ДатаНачала 	  = НачалоДня(ДатаПроверки);
	ДатаОкончания = смартОбщегоНазначения.ПолучитьПрибавитьКДатеКоличествоРабочихДней(ДатаНачала, КоличествоДней); 
	
	//Получение выборки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//++ #Б-2892 смарт: Лопато 01.04.2025 //Ошибка при создании интереса/Регламентное обслуживание клиентов  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//-- #Б-2892 смарт: Лопато 01.04.2025
	|	ТехОбслуживаниеПоКлиентам.ДатаТОУКлиента КАК ДатаТОУКлиента,
	|	ТехОбслуживаниеПоКлиентам.Клиент КАК Клиент,
	|	ТехОбслуживаниеПоКлиентам.Контрагент КАК Контрагент,
	|	ТехОбслуживаниеПоКлиентам.Оборудование КАК Оборудование,
	|	ТехОбслуживаниеПоКлиентам.Серия КАК Серия,
	|	ТехОбслуживаниеПоКлиентам.ДатаПодписанияАктаНаПНР КАК ДатаПодписанияАктаНаПНР,
	|	ТехОбслуживаниеПоКлиентам.СрокЗамены КАК СрокЗамены,
	|	ТехОбслуживаниеПоКлиентам.Запчасть КАК Запчасть,
	|	ТехОбслуживаниеПоКлиентам.Количество КАК Количество,
	|	ТехОбслуживаниеПоКлиентам.Регистратор КАК Регистратор,
	|	ТехОбслуживаниеПоКлиентам.Представительство КАК Представительство
	|ПОМЕСТИТЬ ВТ_Записи
	|ИЗ
	|	РегистрСведений.смартТехническоеОбслуживаниеОборудованияПоКлиентам КАК ТехОбслуживаниеПоКлиентам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартТехническоеОбслуживаниеОборудования КАК ТехОбслужОборудования
	|		ПО ТехОбслуживаниеПоКлиентам.Оборудование = ТехОбслужОборудования.Оборудование
	|ГДЕ
	|	ТехОбслуживаниеПоКлиентам.ДатаТОУКлиента >= &ДатаНачала
	|	И ТехОбслуживаниеПоКлиентам.ДатаТОУКлиента <= &ДатаОкончания
	|	И НЕ ТехОбслуживаниеПоКлиентам.СозданДокументРегламентноеОбслуживание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Записи.Регистратор КАК Регистратор,
	|	смартРуководителиМенеджеровСЦ.Менеджер КАК Менеджер,
	|	смартРуководителиМенеджеровСЦ.Руководитель КАК Руководитель
	|ПОМЕСТИТЬ ВТ_МенеджерыРуководители
	|ИЗ
	|	ВТ_Записи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартРуководителиМенеджеровСЦ КАК смартРуководителиМенеджеровСЦ
	|		ПО ВТ_Записи.Клиент.ОсновнойМенеджер = смартРуководителиМенеджеровСЦ.Менеджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Записи.ДатаТОУКлиента КАК ДатаТОУКлиента,
	|	ВТ_Записи.Клиент КАК Клиент,
	|	ВТ_Записи.Контрагент КАК Контрагент,
	|	ВТ_Записи.Оборудование КАК Оборудование,
	|	ВТ_Записи.Серия КАК Серия,
	|	ВТ_Записи.ДатаПодписанияАктаНаПНР КАК ДатаПодписанияАктаНаПНР,
	|	ВТ_Записи.СрокЗамены КАК СрокЗамены,
	|	ВТ_Записи.Запчасть КАК Запчасть,
	|	ВТ_Записи.Количество КАК Количество,
	//++ #Б-2674 смарт: Лопато 17.03.2025 //Автоматически создавать интересы на основании документа "Регламентное обслуживание клиентов"  
	|	ЕСТЬNULL(ЦеныЗапчастей.Цена, 0) КАК ЦенаЗапчасти,
	//-- #Б-2674 смарт: Лопато 17.03.2025
	|	ВТ_Записи.Регистратор КАК Регистратор,
	|	ВТ_Записи.Представительство КАК Представительство,
	|	ВТ_МенеджерыРуководители.Менеджер КАК Менеджер,
	|	ВТ_МенеджерыРуководители.Руководитель КАК Руководитель
	|ИЗ
	|	ВТ_Записи КАК ВТ_Записи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МенеджерыРуководители КАК ВТ_МенеджерыРуководители
	|		ПО ВТ_Записи.Регистратор = ВТ_МенеджерыРуководители.Регистратор
	//++ #Б-2674 смарт: Лопато 17.03.2025 //Автоматически создавать интересы на основании документа "Регламентное обслуживание клиентов"  
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			ВидЦены.Идентификатор = ""РозничнаяRUB"" 
	|				И Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЦеныЗапчастей
	|		ПО ВТ_Записи.Запчасть = ЦеныЗапчастей.Номенклатура
	//-- #Б-2674 смарт: Лопато 17.03.2025
	|ИТОГИ
	|	МАКСИМУМ(ДатаТОУКлиента),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(Регистратор),
	|	МАКСИМУМ(Представительство),
	|	МАКСИМУМ(Менеджер),
	|	МАКСИМУМ(Руководитель)
	|ПО
	|	Клиент,
	|	Оборудование,
	|	Серия,
	|	ДатаПодписанияАктаНаПНР,
	|	СрокЗамены";

	Запрос.УстановитьПараметр("ДатаНачала",    ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Создание документов
	ВыборкаКлиент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКлиент.Следующий() Цикл
	
		ВыборкаОборудование = ВыборкаКлиент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаОборудование.Следующий() Цикл
			
			ВыборкаСерия = ВыборкаОборудование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСерия.Следующий() Цикл
				
				ВыборкаДатаПодписанияАктаНаПНР = ВыборкаСерия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

				Пока ВыборкаДатаПодписанияАктаНаПНР.Следующий() Цикл
					
					ВыборкаСрокЗамены = ВыборкаДатаПодписанияАктаНаПНР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаСрокЗамены.Следующий() Цикл
						
						НачатьТранзакцию();
						
						НовыйДокумент = Документы.смартРегламентноеОбслуживаниеКлиентов.СоздатьДокумент();

						НовыйДокумент.Дата 					  = ТекущаяДата();
						НовыйДокумент.Статус 				  = Перечисления.смартСтатусыРегламентногоОбслуживания.НеобходимоСвязатьсяСКлиентом;
						НовыйДокумент.НазначенныйМенеджерСЦ   = ВыборкаСрокЗамены.Клиент.смартОсновнойМенеджерСервисЦентра;

						НовыйДокумент.ДатаПодписанияАктаНаПНР = ВыборкаСрокЗамены.ДатаПодписанияАктаНаПНР;
						НовыйДокумент.Клиент 				  = ВыборкаСрокЗамены.Клиент;
						НовыйДокумент.Контрагент 			  = ВыборкаСрокЗамены.Контрагент;
						НовыйДокумент.Оборудование 			  = ВыборкаСрокЗамены.Оборудование;
						НовыйДокумент.ДатаТОУКлиента 		  = ВыборкаСрокЗамены.ДатаТОУКлиента;
						НовыйДокумент.СрокЗамены 			  = ВыборкаСрокЗамены.СрокЗамены;
						НовыйДокумент.ДокументОснование 	  = ВыборкаСрокЗамены.Регистратор;
						НовыйДокумент.Серия 				  = ВыборкаСрокЗамены.Серия;
						НовыйДокумент.Подразделение 		  = ВыборкаСрокЗамены.Представительство;
						
						//++ #Б-2674 смарт: Лопато 17.03.2025 //Автоматически создавать интересы на основании документа "Регламентное обслуживание клиентов"  
						ВыручкаЗапчасти = 0;
						//-- #Б-2674 смарт: Лопато 17.03.2025
						
						Выборка = ВыборкаСрокЗамены.Выбрать();
						
						Пока Выборка.Следующий() Цикл
							
							НоваяСтрока = НовыйДокумент.Запчасти.Добавить();
							
							НоваяСтрока.Запчасть   = Выборка.Запчасть;
							НоваяСтрока.Количество = Выборка.Количество;

							//++ #Б-2674 смарт: Лопато 17.03.2025 //Автоматически создавать интересы на основании документа "Регламентное обслуживание клиентов"  
							ВыручкаЗапчасти = ВыручкаЗапчасти + (Выборка.Количество * Выборка.ЦенаЗапчасти);
							//-- #Б-2674 смарт: Лопато 17.03.2025
							
						КонецЦикла;
						
						НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
						
						//Установка признака, что создан документ
						НаборЗаписей = РегистрыСведений.смартТехническоеОбслуживаниеОборудованияПоКлиентам.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаСрокЗамены.Регистратор);
						
						НаборЗаписей.Прочитать();
						
						Если НаборЗаписей.Количество() > 0 Тогда
							
							Для Каждого Запись Из НаборЗаписей Цикл
								
								Если Запись.ДатаТОУКлиента = ВыборкаСрокЗамены.ДатаТОУКлиента
									И Запись.Клиент = ВыборкаСрокЗамены.Клиент
									И Запись.Контрагент = ВыборкаСрокЗамены.Контрагент
									И Запись.Оборудование = ВыборкаСрокЗамены.Оборудование
									И Запись.Серия = ВыборкаСрокЗамены.Серия
									И Запись.ДатаПодписанияАктаНаПНР = ВыборкаСрокЗамены.ДатаПодписанияАктаНаПНР
									И Запись.СрокЗамены = ВыборкаСрокЗамены.СрокЗамены Тогда
									
									Запись.СозданДокументРегламентноеОбслуживание = Истина;
									
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЕсли;
						
						НаборЗаписей.Записать();
						
						//++ #Б-2674 смарт: Лопато 17.03.2025 //Автоматически создавать интересы на основании документа "Регламентное обслуживание клиентов"  
						Интерес = Документы.CRM_Интерес.СоздатьДокумент();

						Интерес.Дата 				  = НовыйДокумент.Дата;
						Интерес.ДокументОснование 	  = НовыйДокумент.Ссылка;
						Интерес.ЦенаВключаетНДС 	  = Истина;
						Интерес.РучнойВводДатыПродажи = Истина;
						Интерес.ТипУслуги 			  = Справочники.CRM_ТипУслуги.ПоставкаРегламентноеОбслуживаниеКлиентов;
						Интерес.Валюта 				  = Константы.ВалютаРегламентированногоУчета.Получить();
						Интерес.Партнер 			  = НовыйДокумент.Клиент;
						Интерес.Контрагент 			  = НовыйДокумент.Контрагент;
						Интерес.Ответственный 		  = НовыйДокумент.НазначенныйМенеджерСЦ;
						Интерес.СрокРеакции 		  = НовыйДокумент.ДатаТОУКлиента;
						Интерес.Подразделение 		  = НовыйДокумент.НазначенныйМенеджерСЦ.Подразделение;
						Интерес.Офис 				  = НовыйДокумент.НазначенныйМенеджерСЦ.Подразделение.CRM_Офис;  
						Интерес.ОжидаемаяДатаПродажи  = НовыйДокумент.ДатаТОУКлиента;   

						Интерес.ОжидаемаяВыручка = ВыручкаЗапчасти; 
						
						Интерес.Тема = "Предложение РТО для "+ НовыйДокумент.Клиент.Наименование + " на: " + НовыйДокумент.Оборудование.Наименование;
						Интерес.Организация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Интерес.Ответственный, "ОсновнаяОрганизация");

						Если ЗначениеЗаполнено(Справочники.смартПредопределенныеЗначения.СтартовыйЭтапВоронкиРТО.Значение) Тогда
							Интерес.СостояниеИнтереса = Справочники.смартПредопределенныеЗначения.СтартовыйЭтапВоронкиРТО.Значение;
						КонецЕсли;
						
						Интерес.Записать(РежимЗаписиДокумента.Запись);
						
						смартСобытияВзаимодействий.ЗарегистрироватьСобытиеВзаимодействия(
							Перечисления.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес,
							"СозданНовыйИнтерес", 
							Интерес.Ссылка);					
						//-- #Б-2674 смарт: Лопато 17.03.2025
						
						ЗафиксироватьТранзакцию();
						
					КонецЦикла;
					
				КонецЦикла;

			КонецЦикла;

		КонецЦикла;
		
	КонецЦикла;

	ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР, УровеньЖурналаРегистрации.Информация,,, "Окончание");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
